# DataFrame 조작

In [28]:
import pandas as pd

df = pd.DataFrame({"name" : ["Jessica", "Liam", "Sophia", "Alex"],
				   "age": [10,30,29,14],
				   "assign": [100,70,80,95],
				   "test": [10,20,30,40]})

## 1. 이름 변경 rename()

**column** : Column명을 변경.  
**index** : Index명을 변경.  
**inplace** : 원본 데이터를 변경할 것인지 여부 (기본값 : False)

In [29]:
df.rename(columns={"test":"exam"}, inplace=True)

display(df.rename(index={0:"zero", 1:"first"}))

          name  age  assign  exam
zero   Jessica   10     100    10
first     Liam   30      70    20
2       Sophia   29      80    30
3         Alex   14      95    40

## 2. 정렬 sort_values()

지정한 열을 기준으로 데이터를 정렬함.  
**ascending** : 오름차순(True, 기본값), 내림차순(False)

In [30]:
df.sort_values("age", inplace=True)
display(df)

      name  age  assign  exam
0  Jessica   10     100    10
3     Alex   14      95    40
2   Sophia   29      80    30
1     Liam   30      70    20

## 3. 조건에 따라 데이터 추가

**np.where()** : 조건에 따른 값을 numpy배열로 반환  
문법 : np.where(조건, True일 경우 값, False일 경우 값)  
*중첩 np.where도 가능*

In [31]:
import numpy as np

df["adult"] = np.where(df["age"]>=20, "Adult", "Kid")

df["grade"] = np.where(df["assign"]>=90, 'A', 
					   np.where(df["assign"]<80, 'B', 'C'))
display(df)

      name  age  assign  exam  adult grade
0  Jessica   10     100    10    Kid     A
3     Alex   14      95    40    Kid     A
2   Sophia   29      80    30  Adult     C
1     Liam   30      70    20  Adult     B

In [32]:
print(type(np.where(df["age"]>=20, "Adult", "Kid")))

<class 'numpy.ndarray'>

## 4. 빈도수 반환 value_counts()

지정한 열의 데이터들의 빈도를 Series로 반환함.

In [33]:
result = df["grade"].value_counts()
display(result)

grade
A    2
C    1
B    1
Name: count, dtype: int64

## 5. 열 삭제 drop()

In [ ]:
df.drop(columns="exam", inplace=True)
display(df)

# 여러 열도 가능
display(df.drop(columns=["adult", "grade"]))

      name  age  assign  adult grade
0  Jessica   10     100    Kid     A
3     Alex   14      95    Kid     A
2   Sophia   29      80  Adult     C
1     Liam   30      70  Adult     B

      name  age  assign
0  Jessica   10     100
3     Alex   14      95
2   Sophia   29      80
1     Liam   30      70